Mohammed-Alshreif/Master-Embedded-System-Diploma/Unit8_TIMERS_ADC/STM32f103c6_SPWM3PHASE_DRIVER(compelet)/Src/main.c
	pwm->TIMx_ARR=peak;//frec peak value
	pwm->TIMx_CCR1=(duty_cycle);//duty cycle
	pwm->TIMx_PSC=pre;//prescaller

	//	Bit 15 MOE: Main output enable
	//	This bit is cleared asynchronously by hardware as soon as the break input is active. It is set
	//	by software or automatically depending on the AOE bit. It is acting only on the channels
	//	which are configured in output.
	//	0: OC and OCN outputs are disabled or forced to idle state.
	//	1: OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in
	//	TIMx_CCER register).
	//	See OC/OCN enable description for more details
	pwm->TIMx_BDTR |=(1<<15);

	//	Bit 2 CC2IE: Capture/Compare 2 interrupt enable
	//	0: CC2 interrupt disabled
	//	1: CC2 interrupt enabled
	//	Bit 1 CC1IE: Capture/Compare 1 interrupt enable
	//	0: CC1 interrupt disabled
	//	1: CC1 interrupt enabled
	//	Bit 0 UIE: Update interrupt enable
	//	0: Update interrupt disabled
	//	1: Update interrupt enabled
	pwm->TIMx_DIER |=(0b111<<0);

	//	UG: Update generation
	//	This bit can be set by software, it is automatically cleared by hardware.
	//	0: No action
	//	1: Reinitialize the counter and generates an update of the registers. Note that the prescaler
	//	counter is cleared too (anyway the prescaler ratio is not affected). The counter is cleared if
	//	the center-aligned mode is selected or if DIR=0 (upcounting), else it takes the auto-reload
	//	value (TIMx_ARR) if DIR=1 (downcounting).
	pwm->TIMx_EGR |=(1<<0);

	//pwm->TIMx_CR1 |=(1<<0);//enable the timer


}

//===========================================================================
//###########################################################################
void timer_INIT_CH3(uint32_t pre ,uint32_t duty_cycle,uint32_t peak ){

	//	Bit 3 OC3PE: Output Compare 1 preload enable
	//	0: Preload register on TIMx_CCR1 disabled. TIMx_CCR1 can be written at anytime, the
	//	new value is taken in account immediately.
	//	1: Preload register on TIMx_CCR1 enabled. Read/Write operations access the preload
	//	register. TIMx_CCR1 preload value is loaded in the active register at each update event.
	//	Note: 1: These bits can not be modified as long as LOCK level 3 has been programmed
	//	(LOCK bits in TIMx_BDTR register) and CC1S=’00’ (the channel is configured in
	//	output).
	//	2: The PWM mode can be used without validating the preload register only in one
	//	pulse mode (OPM bit set in TIMx_CR1 register). Else the behavior is not guaranteed.
	pwm->TIMx_CCMR2 |=(1<<3);


	//	Bit 8 CC3E: Capture/Compare 1 output enable
	//	CC1 channel configured as output:
	//	0: Off - OC1 is not active. OC1 level is then function of MOE, OSSI, OSSR, OIS1, OIS1N
	//	and CC1NE bits.
	//	1: On - OC1 signal is output on the corresponding output pin depending on MOE, OSSI,
	//	OSSR, OIS1, OIS1N and CC1NE bits.
	//	CC1 channel configured as input:
	//	This bit determines if a capture of the counter value can actually be done into the input
	//	capture/compare register 1 (TIMx_CCR1) or not.
	//	0: Capture disabled.
	//	1: Capture enabled.
	pwm->TIMx_CCER |=(1<<8);


	//	ARPE: Auto-reload preload enable
	//	0: TIMx_ARR register is not buffered
	//	1: TIMx_ARR register is buffered
	pwm->TIMx_CR1 |=(1<<7);


	//	110: PWM mode 1 - In upcounting, channel 1 is active as long as TIMx_CNT<TIMx_CCR1
	pwm->TIMx_CCMR2 |=(0b110<<4);

	pwm->TIMx_ARR=peak;//frec peak value
	pwm->TIMx_CCR3=(duty_cycle);//duty cycle
	pwm->TIMx_PSC=pre;//prescaller

	//	Bit 15 MOE: Main output enable
	//	This bit is cleared asynchronously by hardware as soon as the break input is active. It is set
	//	by software or automatically depending on the AOE bit. It is acting only on the channels
	//	which are configured in output.
	//	0: OC and OCN outputs are disabled or forced to idle state.
	//	1: OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in
	//	TIMx_CCER register).
	//	See OC/OCN enable description for more details
	pwm->TIMx_BDTR |=(1<<15);

	//	Bit 2 CC2IE: Capture/Compare 2 interrupt enable
	//	0: CC2 interrupt disabled
	//	1: CC2 interrupt enabled
	//	Bit 1 CC1IE: Capture/Compare 1 interrupt enable
	//	0: CC1 interrupt disabled
	//	1: CC1 interrupt enabled
	//	Bit 0 UIE: Update interrupt enable
	//	0: Update interrupt disabled
	//	1: Update interrupt enabled
	pwm->TIMx_DIER |=(0b1111<<0);

	//	UG: Update generation
	//	This bit can be set by software, it is automatically cleared by hardware.
	//	0: No action
	//	1: Reinitialize the counter and generates an update of the registers. Note that the prescaler
	//	counter is cleared too (anyway the prescaler ratio is not affected). The counter is cleared if
	//	the center-aligned mode is selected or if DIR=0 (upcounting), else it takes the auto-reload
	//	value (TIMx_ARR) if DIR=1 (downcounting).
	pwm->TIMx_EGR |=(1<<0);

	pwm->TIMx_CR1 |=(1<<0);//enable the timer


}

//===========================================================================
//###########################################################################

void timer2_INIT_CH1(uint32_t pre , uint32_t peak ){

	SPWM3PHASE->TIMx_CR1  |=(1<<2);
	SPWM3PHASE->TIMx_DIER |=(1<<0);



	SPWM3PHASE->TIMx_ARR=peak;//frec peak value

	SPWM3PHASE->TIMx_PSC=pre;//prescaller

	SPWM3PHASE->TIMx_EGR |=(1<<0);
	SPWM3PHASE->TIMx_CR1 |=(1<<0);//enable the timer




}
//===========================================================================
//###########################################################################
//===========================================================================
//###########################################################################
void timer3_INIT_CH2(uint32_t pre ,uint32_t duty_cycle,uint32_t peak ){

	//pwm->TIMx_CR1 &=~(1<<0);

	//	Bit 11 OC2PE: Output Compare 1 preload enable
	//	0: Preload register on TIMx_CCR1 disabled. TIMx_CCR1 can be written at anytime, the
	//	new value is taken in account immediately.
	//	1: Preload register on TIMx_CCR1 enabled. Read/Write operations access the preload
	//	register. TIMx_CCR1 preload value is loaded in the active register at each update event.
	//	Note: 1: These bits can not be modified as long as LOCK level 3 has been programmed
	//	(LOCK bits in TIMx_BDTR register) and CC1S=’00’ (the channel is configured in
	//	output).
	//	2: The PWM mode can be used without validating the preload register only in one
	//	pulse mode (OPM bit set in TIMx_CR1 register). Else the behavior is not guaranteed.

	half_wave->TIMx_CCMR1 |=(1<<11);

