Mohammed-Alshreif/Master-Embedded-System-Diploma/Unit8_TIMERS_ADC/STM32f103c6_SPWM3PHASE_DRIVER(compelet)/Src/main.c
	half_wave->TIMx_ARR=peak;//frec peak value
	half_wave->TIMx_CCR3=(duty_cycle);//duty cycle
	half_wave->TIMx_PSC=pre;//prescaller

	//	Bit 15 MOE: Main output enable
	//	This bit is cleared asynchronously by hardware as soon as the break input is active. It is set
	//	by software or automatically depending on the AOE bit. It is acting only on the channels
	//	which are configured in output.
	//	0: OC and OCN outputs are disabled or forced to idle state.
	//	1: OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in
	//	TIMx_CCER register).
	//	See OC/OCN enable description for more details
	half_wave->TIMx_BDTR |=(1<<15);

	//	Bit 2 CC2IE: Capture/Compare 2 interrupt enable
	//	0: CC2 interrupt disabled
	//	1: CC2 interrupt enabled
	//	Bit 1 CC1IE: Capture/Compare 1 interrupt enable
	//	0: CC1 interrupt disabled
	//	1: CC1 interrupt enabled
	//	Bit 0 UIE: Update interrupt enable
	//	0: Update interrupt disabled
	//	1: Update interrupt enabled
	half_wave->TIMx_DIER |=(0b1111<<0);

	//	UG: Update generation
	//	This bit can be set by software, it is automatically cleared by hardware.
	//	0: No action
	//	1: Reinitialize the counter and generates an update of the registers. Note that the prescaler
	//	counter is cleared too (anyway the prescaler ratio is not affected). The counter is cleared if
	//	the center-aligned mode is selected or if DIR=0 (upcounting), else it takes the auto-reload
	//	value (TIMx_ARR) if DIR=1 (downcounting).
	half_wave->TIMx_EGR |=(1<<0);

	half_wave->TIMx_CR1 |=(1<<0);//enable the timer


}
//===========================================================================
//###########################################################################
//===========================================================================
//###########################################################################

void pwm_INIT(){
	MCAL_speed_init(CLK_SORC_IN_CLK8MHz, mood_FAST_MOOD_72MHzCORE);//speed of all 36MHz
	GPIOA_Clock_Enable();//enable porta clock
	GPIOB_Clock_Enable();//enable portb clock
	TIMER1_CLOCK_Enable();//enable timer1 clock
	TIMER2_CLOCK_Enable();//enable timer2 clock
	TIMER3_CLOCK_Enable();//enable timer3 clock
	AFIO_Clock_Enable();//enable AF io clock
	//NVIC_TIM1_UP_Enable;
	//NVIC_TIM1_CC_Enable;//enable capture compare nvic
	NVIC_TIM2_global_interrupt_Enable;
	//=====================pins mode============================
	pinmode(GPIOA, pin8, GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
	pinmode(GPIOA, pin9, GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
	pinmode(GPIOA, pin10,GPIO_MODE_OUTPUT_AF_push_pull_Speed50);

	pinmode(GPIOA, pin6, GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
	pinmode(GPIOA, pin7, GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
	pinmode(GPIOB, pin0,GPIO_MODE_OUTPUT_AF_push_pull_Speed50);

	var4 = 126 * sin(A + Phase1);
	var1 = var4 + 128;
	var5 = 126 * sin(A + Phase2);
	var2 = var5 + 128;
	var6 = 126 * sin(A + Phase3);
	var3 = var6 + 128;
	timer_INIT_CH1(presc,var1,top);
	timer_INIT_CH2(presc,var2,top);
	timer_INIT_CH3(presc, var3, top);

	timer3_INIT_CH1(presc,var1,top);
	timer3_INIT_CH2(presc,var2,top);
	timer3_INIT_CH3(presc, var3, top);
	pinmode(GPIOB, pin1,GPIO_MODE_OUTPUT_push_pull_Speed10);
	//    pinmode(GPIOA, pin4,GPIO_MODE_OUTPUT_push_pull_Speed50);
	//pinmode(GPIOA, pin5,GPIO_MODE_OUTPUT_push_pull_Speed2);
}
//============================================================
//########################### interface ######################
//============================================================
//void frec_controle(){
//	_delay_ms(1000);
//	if(user_freq>=(370))user_freq=1;
//	else user_freq+=1;
//	user_flage=0;
//	//notes============================
//	//min top=7485 when presc =0
//	//max top=32000
//	//to calculate an accurate frequency
//	//you must use this formula
//	//inputs frequency and prescaler and the output is top"counterstics"
//	//top=1/(f*(1\36*10^6) *13 * prescaler )
//
//	while(user_flage==1){
//		user_top = (36000000)/(user_freq *13 * user_pre );
//		if(user_top>=32000){
//			user_pre+=2;
//		}
//		else{
//			user_flage=0;
//		}
//	}
//
//	timer2_INIT_CH1(user_pre-1,user_top);
//}
//void frec_controle_decrease(){
//	_delay_ms(1000);
//	if(user_freq<=(1))user_freq=370;
//	else user_freq-=1;
//	user_flage=0;
//	//notes============================
//	//min top=7485 when presc =0
//	//max top=32000
//	//to calculate an accurate frequency
//	//you must use this formula
//	//inputs frequency and prescaler and the output is top"counterstics"
//	//top=1/(f*(1\36*10^6) *13 * prescaler )
//
//	while(user_flage==1){
//		user_top = (36000000)/(user_freq *13 * user_pre );
//		if(user_top>=32000){
//			user_pre+=2;
//		}
//		else{
//			user_flage=0;
//		}
//	}
//
//	timer2_INIT_CH1(user_pre-1,user_top);
//}

//============================================================
//########################### main ##########################
//============================================================
int main(void)
{
	//	EXTI(GPIOB,pin10,EXTI_Trigger_Falling,frec_controle);
	//	EXTI(GPIOB,pin11,EXTI_Trigger_Falling,frec_controle_decrease);
	//==================$$$$$$$$$$$$$$$$$$==================
	pwm_INIT();
	//=================$$$$$$$$$$$$$$$$$$===================

	//	//notes============================
	//	//min top=7485 when presc =0
	//	//max top=32000
	//	//to calculate an accurate frequency
	//	//you must use this formula
	//	//inputs frequency and prescaler and the output is top"counterstics"
	//	//top=1/(f*(1\36*10^6) *13 * prescaler )
	user_freq=20;
	while(user_flage==1){
		user_top = (36000000)/(user_freq *13 * user_pre );
		if(user_top>=32000){
			user_pre+=2;
		}
		else{
			user_flage=0;
		}
	}

	timer2_INIT_CH1(user_pre-1,user_top);
}
//============================================================
//####################### interrupt ##########################
//============================================================
void TIM2_IRQHandler(){

	pinwrite(GPIOB, pin1 ,HIGH);
	SPWM3PHASE->TIMx_SR &=~(1<<0);
	A += B;
	if (A >=2* M_PI)
	{
		A = 0;
	}

	//==================================================
	var1 = (126 * sinf(A + Phase1) + 128);
	var2 = (126 * sinf(A + Phase2) + 128);
	var3 = (126 * sinf(A + Phase3) + 128);
	//==================================================
	pwm->TIMx_ARR=top;//frec peak value
	half_wave->TIMx_ARR=top;//frec peak value

	if(var1>=(top/2)){
		//pwm->TIMx_CCR1=(0);//duty cycle
		pinmode(GPIOA, pin8, GPIO_MODE_INTPUT_AF);
		pinmode(GPIOA, pin6, GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
		half_wave->TIMx_CCR1=(var1);//duty cycle
	}
	else{
		pinmode(GPIOA, pin6, GPIO_MODE_INTPUT_AF);
		pinmode(GPIOA, pin8, GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
		pwm->TIMx_CCR1=(var1);//duty cycle
	}

	if(var2>=(top/2)){
		//pwm->TIMx_CCR2=(0);//duty cycle
		pinmode(GPIOA, pin9, GPIO_MODE_INTPUT_AF);
		pinmode(GPIOA, pin7, GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
		half_wave->TIMx_CCR2=(var2);//duty cycle
	}
	else
	{
		pinmode(GPIOA, pin7, GPIO_MODE_INTPUT_AF);
		pinmode(GPIOA, pin9, GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
		pwm->TIMx_CCR2=(var2);//duty cycle
	}

	if(var3>=(top/2)){
		//pwm->TIMx_CCR3=(0);//duty cycle
		pinmode(GPIOA, pin10,GPIO_MODE_INTPUT_AF);
		pinmode(GPIOB, pin0, GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
		half_wave->TIMx_CCR3=(var3);//duty cycle
	}
	else{
		pinmode(GPIOB, pin0, GPIO_MODE_INTPUT_AF);
		pinmode(GPIOA, pin10,GPIO_MODE_OUTPUT_AF_push_pull_Speed50);
		pwm->TIMx_CCR3=(var3);//duty cycle
	}
	pwm->TIMx_PSC=presc;//prescaller
	half_wave->TIMx_PSC=presc;//prescaller
	pwm->TIMx_EGR |=(1<<0);
	half_wave->TIMx_EGR |=(1<<0);
	pwm->TIMx_CR1 |=(1<<0);//enable the timer
	half_wave->TIMx_CR1 |=(1<<0);//enable the timer
	pinwrite(GPIOB, pin1 ,LOW);
}
